# Relatório de Análise IV
## Seleção e Frequências

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv(r"C:\Users\fabia\OneDrive\FIAP_INICIO\WarnUp_materiais\aluguel_residencial.csv", sep=';')

In [4]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

# Frequências e Seleções

* Selecione somente os imóveis classificados com tipo 'Apartamento'.

* Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.

* Somente os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.

* Somente os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.

In [10]:
# Selecione somente os imóveis classificados com tipo 'Apartamento'.
selecao = dados['Tipo'] == 'Apartamento'
n1 = dados[selecao].shape[0]
n1
# 19532 registros de 'Apartamento'

19532

In [13]:
# Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
selecao = (dados['Tipo'] == 'Casa')| (dados['Tipo'] == 'Casa de Condomínio') | (dados['Tipo'] == 'Casa de Vila')
n2 = dados[selecao].shape[0]
n2

2212

In [16]:
# Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
# é equivalente falar que a área está entre 60 e 100 mts 2 --> 60<= Area <=100

selecao = (dados['Area']>=60) & (dados['Area']<=100)
n3 = dados[selecao].shape[0]
n3

8719

In [17]:
# Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.
selecao = (dados['Quartos']>=4) & (dados['Valor']<2000)
n4 = dados[selecao].shape[0]
n4

41

In [19]:
print("N° de imóveis classificados com tipo 'Apartamento'. --> {} ".format(n1))
print("N° de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'. --> {} ".format(n2))
print("N° de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites. --> {} ".format(n3))
print("N° de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00. --> {} ".format(n4))

N° de imóveis classificados com tipo 'Apartamento'. --> 19532
N° de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'. --> 2212
N° de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites. --> 8719
N° de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00. --> 41

Exercícios

In [20]:

alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [22]:
alunos.head(10)

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [30]:
# Crie um DataFrame somente com alunos aprovados
selecao = alunos ['Aprovado'] == True
aprovados = alunos[selecao]
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [35]:
# Crie um DataFrame somente com as alunas aprovadas.
selecao = (alunos['Aprovado'] == True) & (alunos['Sexo']=='F')
alunas_aprovadas = alunos[selecao]
alunas_aprovadas

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [40]:
# Crie apenas uma visualização dos alunos com idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos.
selecao = ((alunos.Idade >= 10) & 
    (alunos.Idade <= 20)) | (alunos.Idade >= 40)
alunos[selecao]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [65]:
# Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.
selecao=alunos['Aprovado']==False
reprovados = alunos.loc[selecao,['Nome','Sexo','Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [68]:
selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Sexo', 'Idade']][selecao]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [69]:
# Crie uma visualização com os três alunos mais novos.
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

# Formas de Seleção

In [41]:
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [43]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (9, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [44]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [45]:
# Selecionando uma coluna
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [46]:
# Selecionando 2 colunas em uma ordem desejada
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [47]:
# uma outra forma de fazer /  todas as linhas
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [48]:
# a partir da linha 1
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [49]:
# Selecionar determinadas linhas (quero a linha 1 e 2, então tenho que declarar até a linha 3) / A ultima declarada nunca aparece/nunca inclui o último índice
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [50]:
# a partir da linha 1 eu quero somente a coluna c3 e c1
df[1:][['c3','c1']]

    c3  c1
l2   7   5
l3  11   9
l4  15  13

In [53]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [52]:
# loc --> permite que eu faça seleção a partir dos rótulos das linhas
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [54]:
# linha 3 e linha 2
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [55]:
# batalha naval
df.loc['l1','c2']

2

In [56]:
# iloc --> utiliza os índices numéricos
df.iloc[0,1] # pegou linha 1 com a coluna 2 / batalha naval

2

In [57]:
df.loc[['l3','l1'],['c4','c1']]

    c4  c1
l3  12   9
l1   4   1

In [58]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [60]:
#  resultado acima usando o iloc
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   9
l1   4   1